package org.toastit_v2.common.generator.nickname;

public class Nickname {

    public static final String[] prefix = new String[]{
            "가냘픈", "가는", "가엾은", "가파른", "같은", "거센", "거친", "건조한", "검은", "게으른", "게을러빠진", "게을러터진", "고달픈", "고른", "고마운", "고운", "고픈", "곧은",
            "괜찮은", "구석진", "굳은", "굵은", "귀여운", "그런", "그른", "그리운", "기다란", "기쁜", "긴", "깊은", "깎아지른", "깨끗한", "나쁜", "나은", "난데없는", "날랜",
            "날카로운", "낮은", "너그러운", "너른", "널따란", "넓은", "네모난", "노란", "높은", "누런", "느린", "늦은", "다른", "더운", "동그란", "둥그런", "둥근", "드문", "딱한",
            "뛰어난", "뜨거운", "막중한", "많은", "멋진", "못된", "무거운", "무딘", "무른", "무서운", "미끈미끈한", "미운", "바람직스러운", "반가운", "밝은", "보람찬", "보잘것없는",
            "부드러운", "빠른", "빨간", "뻘건", "뼈저린", "뽀얀", "뿌연", "새로운", "서툰", "섣부른", "성가신", "센", "수다스러운", "수줍은", "쉬운", "스스러운", "슬픈", "시원찮은",
            "싫은", "쌀쌀맞은", "쏜살같은", "아쉬운", "아픈", "안쓰러운", "안타까운", "약빠른", "약은", "어린", "언짢은", "엄청난", "예쁜", "올바른", "옳은", "외로운", "작은",
            "잘난", "재미있는", "젊은", "점잖은", "조그만", "좋은", "즐거운", "지나친", "지혜로운", "짓궂은", "큰", "푸른", "한결같은", "희망찬", "힘겨운", "힘찬"
    };

    public static String[] names = new String[]{"키티", "쿠로미", "시나모롤", "위시미메", "뚱이", "별가사리", "징징이", "스펀지밥", "집게", "뾰롱이", " 꼬양이", "뽀로로", "도키", "빠밤", "오래", "플플", "으냉", "참참",
            "살리", "알란", " 앨리", "앨빈", "아미", "아만다", "아모스", "에이미", "애니", "아스터", "아샤", "오로라", "바바", "바론", "바니", "발리", "비숍", "비앙카", "보니타", "브라이트",
            "버디", "버니", "시저", "칼라", "세실", "캐서린", "캐시", "찰스", "체이스", "샤비", "첼시", "쉐리", "클라라", "크림슨", "크리스탈", "코디", " 처비", "데이지", "다니카", "데이브", "델링"
            , "델핀", "데니스", "덴버", "딕", "덱스터", "디노", "더글라스", "엠버", "카라", "가인", "유려", "썅띠에", "에쓰쁘아", "유려", "우화", "나비잠", "예그리나", "시나브로", "수피아",
            "아가사", "루시", "소피아", "사라", "이레인", "비비안", "알리", "레이첼", "아리엘", "도로시", "휴", "제니", "카레나", "라라", "소니아", "바이올렛", "스텔라", "미코", "테라", "아니마", "벤투스",
            "아쿠아", "칼리고", "이그니스", "네뷸라", "리시오", "스페스", "테라", "아모르", "비타", "포르투나", "템푸스", "아에떼르눔", "오피뉴", "세크레투스", "옵타움", "가우디움", "플로스"
    };

}
